/** 職業群與其底下的職業列表 */
export const JOB_GROUPS = [
  { group: '冒險家-劍士', jobs: ['英雄', '聖騎士', '黑騎士'] },
  { group: '冒險家-法師', jobs: ['主教', '大魔導士(冰、雷)', '大魔導士(火、毒)'] },
  { group: '冒險家-弓箭手', jobs: ['箭神', '神射手', '開拓者'] },
  { group: '冒險家-盜賊', jobs: ['夜使者', '暗影神偷', '影武者'] },
  { group: '冒險家-海盜', jobs: ['槍神', '拳霸', '重砲指揮官'] },
  {
    group: '皇家騎士團',
    jobs: ['聖魂劍士', '烈焰巫師', '破風使者', '暗夜行者', '閃雷悍將', '米哈逸(團長)'],
  },
  { group: '英雄團', jobs: ['狂狼勇士', '龍魔導士', '精靈遊俠', '幻影俠盜', '隱月', '夜光'] },
  {
    group: '末日反抗軍',
    jobs: ['爆拳槍神', '煉獄巫師', '狂豹獵人', '機甲戰神', '傑諾', '惡魔殺手', '惡魔復仇者'],
  },
  { group: '超新星', jobs: ['凱撒', '凱殷', '卡蒂娜', '天使破壞者'] },
  { group: '雷普', jobs: ['阿戴爾', '伊利恩', '卡莉', '亞克'] },
  { group: '阿尼瑪', jobs: ['蓮', '菈菈', '虎影'] },
  { group: '朋友世界', jobs: ['凱內西斯'] },
  { group: '超越者', jobs: ['神之子'] },
  { group: '海外職業-曉之陣', jobs: ['劍豪', '陰陽師'] },
  { group: '海外職業-江湖', jobs: ['琳恩', '墨玄'] },
] as const;
export type JobGroup = (typeof JOB_GROUPS)[number]['group'];
